print("Hello, world!")
# Python - інтерпретатор (REPL)
# Python-3 4GL, мультипарадигмальний, основна парадигма - функціональна
# типізація - динамічна, змінна на запис; розділення команд ";" або з нового рядка. ";" не рекомендується
x = 10              # оголошення змінних не потрібне, задається ініціалізацією
print(x, type(x))   # 10 <class 'int'>
x = "20"            # нове присвоєння - можлива зміна типу даних
print(x, type(x))   # 20 <class 'str'>
# print(x + 5)      # помилка - робота з різними типами
print(int(x) + 5)   # 25 - перетворення типу - виклик конструктор класу
print(x + str(5))   # 205 - конкатенація
x = 2 + 3j          # орієнтація на математику має підтримку комплексних чисел ...
print(x, type(x))   # (2+3j) <class 'complex'>
print(2 ** 256)     # ... а також підтримку великих чисел (цілих), формального обмеження немає
print(2.0 ** 256)   # дробові числа - обмеження 64 біти
y = 2.5
print(y, type(y))   # 2.5 <class 'float'>
w = 10
print(x + y)        # тест на "сувору типізацію" - неможливість операцій
print(x + w)        # з різними типами даних
print(y + w)        # результат - типізація не сувора, різні типи допускаються
y = True            # логічні константи - з великої літери
print(y, type(y))   # True <class 'bool'>
y = (10, 20)        # кортеж (tuple) - основний тип даних функціональних мов
print(y, type(y))   # (10, 20) <class 'tuple'>
y = [10, 20]        # list - аналог колекцій, доступний для змін
print(y, type(y))   # [10, 20] <class 'list'>
y = { "x": 10 }     # асоціативний масив або словник або Map
print(y, type(y))   # {'x': 10} <class 'dict'>
x, y = 10, 20       # кортежне присвоювання
s = 'String'
s = "String"
s = """ Multi
line
string """
s = f"x = {x}, y = {y}"          # інтерполяція, імперативний стиль
print(s)
s = ("x = %d, y = %d" % (x, y))  # інтерполяція, кортежний стиль
print(s)
print(b"Hello")                  # бінарізація - перетворення до бінарного коду