# Оператори та операції
# Арифметичні
x, y = 14, 6
print("%d + %d = %f" % (x, y, x + y))
print("%d - %d = %f" % (x, y, x - y))
print("%d * %d = %f" % (x, y, x * y))
print("%d / %d = %f" % (x, y, x / y))     # int/int -> float
print("%d // %d = %f" % (x, y, x // y))   # int//int -> int
print("%d ** %d = %f" % (x, y, x ** y))
print("%d %% %d = %f" % (x, y, x % y))    # характерно для ф.мов - роль оператора залежить від операндів

# умовний оператор і формування блоків
if x > 2 and y > 2 :   # дужки для оператора не потрібні, логічні умови 
    print("x > 2")     # поєднуються мнемонічними операторами (or, and, not, ...)
    print("and")       # Блок починається символом ":"
    print("y > 2")     # та формується відступами від лівого краю.
                       # Традиція - залишати рядок після блоку
print(1)               # Завершується блок втяжкою

if x < 2 :
    print("x < 2")     # кількість пробілів у відступах різних блоків - довільна
elif x < 4 :           # умовний оператор може мати elif умови
 print("x < 4")
elif x < 6 :           # кількість elif умов - довільна
  print("x < 6")
else : print("other")  # плюс загальний else - опціонально

# тернарний вираз 
w = 10 if x > 2 else 20

# Оператор циклу
y = 10
while not y == 0 :
   print(y, end=' ')
   # if y < 5 : break
   y -= 1               # скорочених форм "++", "--" немає
else :                  # блок else виконується коли порушується циклова умова
   print(y)             # ознака успішного завершення, через break блок не виконується

# Цикл-ітератор
r10 = range(10)         # генератор - правило побудови послідовності
print(r10, type(r10))
for i in r10 :
   print(i, end='')
print()

for i in range(20, 2, -2) :
   print(i, end=' ')
print()

x = input("x = ")
print(x, type(x))
'''
Д.З. Реалізувати програму, яка запитує у користувача параметри для
циклу: початкове число, кінцеве число, крок.
Забезпечити перевірку на відмінність чисел і дозволеність кроку.
Знак для кроку підбирати автоматично.
наприклад:
від: 20
до: 12
крок: 2
20 18 16 14 12

від: 10
до: 12
крок: 2
10 12

До звіту додати скріншот роботи програми
'''