# Функції (процедури)
def print_hello() :      # Ф-ції оголошуються ключовим словом def, традиція іменування -
    print("Hello")       # snake_case. Тіло ф-ції формується блоком (відступами)
                         # Традиційно між функціями лишають два порожні рядки
                         #  Перевантаження функцій або параметричний поліморфізм
def print_hello(x) :     # відсутнє - нове оголошення функції суть замінює попереднє оголошення  
    print("Hi,", x)      # помилок оголошення не виникає, можливі помилки виклику.
                         # Поліморфізм функцій забезпечується параметрами зі значеннями
                         # за замовчанням. У такому разі виклик можливий як з параметром,
def print_hello(x='') :  # так і без нього.
    print("Hola", x)


def greet(                           # Іменування параметрів дозволяє звертатись до них не 
        phrase:str='Hello',          # за порядком (передавати довільний набір)
        who:str='all') -> None :     # тип параметрів зазначається ":", самої ф-ції  "->"
    '''Демонстрація параметрів
    за замовчанням:

    phrase - перше слово

    who - суб'єкт вітання'''         # '''Документуючий коментар'''
    
    print(phrase, who)               # Зазначення типів - підказка, але не обмеження і не перетворення


# Взаємодія з глобальною областю
x = 10

def get_x() :                # Принцип пошуку сутності за іменем: починаючи з локальної області 
    return x                 # піднімаємось все вище і вище доки сутність не буде знайдена

def set_x(new_value) :       # Принцип той самий, але щодо створення: "чи можна створити у локальній області?"
    x = new_value            # !! це створення локальної змінної, а не звернення до глобальної
    print('x set to', x)

def set_global_x(new_value) :
    global x
    x = new_value


print( 'x =', get_x() )
set_x(20)
print( 'x =', get_x() )
set_global_x(20)
print( 'x =', get_x() )

# Рекурсія
def show(x:int) -> None :
    print(x, end=' ')
    if x > 0 :
        show(x - 1)
    else :
        print()


def main() :
    show(10)

    print_hello()
    print_hello("User")
    greet()
    greet('Hi')
    greet('Hi', 'World')
    greet(who='World')
    greet(who=2)


# запобіжник від викликів при підключенні файла як модуля (бібліотеки)
if __name__ == "__main__" : main()