# OOP
class Point:
    x = 0     # поля, описані у класі, є доступними
    y = 0     # та статичними



def main() :
    p1 = Point()       # без оператора new
    p2 = Point()
    print(p1.x, p1.y)  # 0 0  На момент створення об'єктів у них немає 
    print(p2.x, p2.y)  # 0 0  власних полів і вони звертаються до статичного Point.x
    Point.x = 10       # зміна статичного поля
    print(p1.x, p1.y)  # 10 0  Результат зміни відбивається на обох об'єктах,
    print(p2.x, p2.y)  # 10 0  підтверджуючи звернення до Point.x
    p1.x = 20          # Перевірка доступу до поля через посилання на об'єкт
    print(p1.x, p1.y)  # 20 0  відбувається створення об'єктного поля у р1
    print(p2.x, p2.y)  # 10 0  тоді як р2 продовжує звертатись до Point.x
    del p1.x           # видалення об'єктного поля
    print(p1.x, p1.y)  # 10 0  знищення поля знов призводить до Point.x
    print(p2.x, p2.y)  # 10 0
    # Для створення об'єктних полів необхідне посилання на сам об'єкт
    # Таке посилання вперше з'являється у конструкторі, тому саме у ньому 
    # прийнято оголошувати поля.


if __name__ == '__main__' :
    main()
